Repository: TR0U8L3-gif/TKI
Catalog: lib/config/l10n/app_*.arb
Languages: es, pl

source: Hello World!
es: ¡Hola Mundo!
pl: Witaj świecie!

source: TKI Assessment
es: Evaluación TKI
pl: Test TKI

source: Interpretation Report
es: Informe de Interpretación
pl: Raport interpretacyjny

source: Assessment History
es: Historial de Evaluaciones
pl: Historia ocen

source: TKI Questions Set
es: Conjunto de Preguntas TKI
pl: Zestawy pytań TKI

source: Language
es: Idioma
pl: Język

# languageName
source: {language, select, en{English} pl{Polish} es{Spanish} other{Language unknown}}
es: {language, select, en{Inglés} pl{Polaco} es{Español} other{Idioma desconocido}}
pl: {language, select, en{Angielski} pl{Polski} es{Hiszpański} other{Język nieznany}}

source: Competing
es: Competir
pl: Konkurencyjny

source: Collaborating
es: Colaborar
pl: Współpracujący

source: Compromising
es: Comprometerse
pl: Kompromisowy

source: Avoiding
es: Evitar
pl: Unikający

source: Accommodating
es: Acomodar
pl: Dostosowujący się

# competingDescription
source: Assertive and uncooperative
es: Asertivo y no cooperativo
pl: Asertywny i niewspółpracujący

# collaboratingDescription
source: Assertive and cooperative
es: Asertivo y cooperativo
pl: Asertywny i współpracujący

# compromisingDescription
source: Intermediate in assertiveness and cooperativeness
es: Intermedio en asertividad y cooperación
pl: Pośredni w asertywności i współpracowaniu

# avoidingDescription
source: Unassertive and uncooperative
es: No asertivo y no cooperativo
pl: Nieasertywny i niewspółpracujący

# accommodatingDescription
source: Unassertive and cooperative
es: No asertivo y cooperativo
pl: Nieasertywny i współpracujący

source: Assertiveness
es: Asertividad
pl: Asertywność

source: Cooperativeness
es: Cooperación
pl: Współpracowniczość

source: Unassertive
es: No asertivo
pl: Nieasertywny

source: Assertive
es: Asertivo
pl: Asertywny

source: Uncooperative
es: No cooperativo
pl: Niewspółpracujący

source: Cooperative
es: Cooperativo
pl: Współpracujący

# assertivenessDescription
source: is how much members try to satisfy their own concerns.
es: es cuánto los miembros intentan satisfacer sus propias preocupaciones.
pl: to stopień, w jakim członkowie starają się zaspokoić swoje własne potrzeby.

# cooperativenessDescription
source: is how much members try to satisfy the other's concerns.
es: es cuánto los miembros intentan satisfacer las preocupaciones de los demás.
pl: to stopień, w jakim członkowie starają się zaspokoić potrzeby drugiej strony.

# interpretationReportTitle
source: The Five Conflict-Handling Modes
es: Los Cinco Modos de Manejo de Conflictos
pl: Pięć trybów radzenia sobie z konfliktem

# interpretationReportDescription
source: The Thomas-Kilmann Conflict Mode Instrument (TKI) assesses an individual’s behavior in conflict situations—that is, situations in which the concerns of two people appear to be incompatible. In conflict situations, we can describe a person’s behavior along two basic dimensions: assertiveness and cooperativeness. These two dimensions of behavior can be used to define five methods of dealing with conflict. These five conflict-handling modes are shown below:
es: El Instrumento de Modo de Conflicto Thomas-Kilmann (TKI) evalúa el comportamiento de una persona en situaciones de conflicto, es decir, situaciones en las que las preocupaciones de dos personas parecen ser incompatibles. En situaciones de conflicto, podemos describir el comportamiento de una persona a lo largo de dos dimensiones básicas: asertividad y cooperación. Estas dos dimensiones de comportamiento se pueden utilizar para definir cinco métodos de manejo de conflictos. Estos cinco modos de manejo de conflictos se muestran a continuación:
pl: Instrument Konfliktu Thomasa-Kilmanna (TKI) ocenia zachowanie jednostki w sytuacjach konfliktowych, w których interesy dwóch osób wydają się być niezgodne. W sytuacjach konfliktowych można opisać zachowanie osoby wzdłuż dwóch podstawowych wymiarów: asertywności i współpracy. Te dwa wymiary zachowania można wykorzystać do zdefiniowania pięciu metod radzenia sobie z konfliktem. Poniżej przedstawiono te pięć trybów radzenia sobie z konfliktem:

# competingDefinition
source: is assertive and uncooperative, a power-oriented mode. When competing, an individual pursues his or her own concerns at the other person’s expense, using whatever power seems appropriate to win his or her position. Competing might mean standing up for your rights, defending a position you believe is correct, or simply trying to win.
es: es asertivo y no cooperativo, un modo orientado al poder. Cuando se compite, una persona persigue sus propias preocupaciones a expensas de la otra persona, utilizando cualquier poder que parezca apropiado para ganar su posición. Competir puede significar defender tus derechos, defender una posición que crees que es correcta o simplemente tratar de ganar.
pl: jest asertywny i niewspółpracujący, to tryb zorientowany na władzę. W trybie rywalizacji jednostka dąży do zaspokojenia swoich własnych potrzeb kosztem drugiej osoby, używając odpowiedniej siły, aby zdobyć swoją pozycję. Rywalizacja może oznaczać bronienie swoich praw, obronę stanowiska, które uważasz za poprawne, lub po prostu próbę zwycięstwa.

# collaboratingDefinition
source: is both assertive and cooperative. When collaborating, an individual attempts to work with the other person to find a solution that fully satisfies the concerns of both. It involves digging into an issue to identify the underlying concerns of the two individuals and to find an alternative that meets both sets of concerns. Collaborating between two persons might take the form of exploring a disagreement to learn from each other’s insights, resolving some condition that would otherwise have them competing for resources, or confronting and trying to find a creative solution to an interpersonal problem
es: es tanto asertivo como cooperativo. Cuando se colabora, una persona intenta trabajar con la otra persona para encontrar una solución que satisfaga completamente las preocupaciones de ambos. Implica profundizar en un problema para identificar las preocupaciones subyacentes de las dos personas y encontrar una alternativa que satisfaga ambas preocupaciones. La colaboración entre dos personas puede tomar la forma de explorar un desacuerdo para aprender de las ideas de cada uno, resolver alguna condición que de otro modo los haría competir por recursos o enfrentar y tratar de encontrar una solución creativa a un problema interpersonal.
pl: jest zarówno asertywny, jak i współpracujący. W trybie współpracy jednostka stara się współpracować z drugą osobą, aby znaleźć rozwiązanie, które w pełni zaspokaja obawy obu stron. Polega to na zgłębianiu problemu w celu zidentyfikowania ukrytych obaw obu osób i znalezienia alternatywy, która spełnia obie strony. Współpraca między dwiema osobami może przybrać formę eksploracji różnicy zdań w celu uczenia się z wglądów drugiej osoby, rozwiązania warunku, który w przeciwnym razie skłoniłby ich do rywalizacji o zasoby lub konfrontacji i próby znalezienia kreatywnego rozwiązania problemu interpersonalnego.

# compromisingDefinition
source: is intermediate in both assertiveness and cooperativeness. When compromising, the objective is to find an expedient, mutually acceptable solution that partially satisfies both parties. Compromising falls on a middle ground between competing and accommodating, giving up more than competing but less than accommodating. Likewise, it addresses an issue more directly than avoiding but doesn’t explore it in as much depth as collaborating. Compromising might mean splitting the difference, exchanging concessions, or seeking a quick middle-ground position.
es: es intermedio tanto en asertividad como en cooperación. Cuando se llega a un compromiso, el objetivo es encontrar una solución mutuamente aceptable y rápida que satisfaga parcialmente a ambas partes. El compromiso se encuentra en un punto intermedio entre competir y acomodar, cediendo más que competir pero menos que acomodar. Del mismo modo, aborda un problema de manera más directa que evitar, pero no lo explora en profundidad como colaborar. Llegar a un compromiso puede significar dividir la diferencia, intercambiar concesiones o buscar una posición intermedia rápida.
pl: jest pośredni zarówno w asertywności, jak i współpracy. W trybie kompromisu celem jest znalezienie szybkiego, wzajemnie akceptowalnego rozwiązania, które częściowo zaspokaja obie strony. Kompromis znajduje się na środkowej drodze między rywalizacją a dostosowaniem, ustępując więcej niż w przypadku rywalizacji, ale mniej niż w przypadku dostosowania. Podobnie, zajmuje się kwestią bardziej bezpośrednio niż unikanie, ale nie zgłębia jej tak dogłębnie jak współpraca. Kompromis może oznaczać podział różnicy, wymianę ustępstw lub poszukiwanie szybkiej pozycji na środku drogi.

# avoidingDefinition
source: is unassertive and uncooperative—an essentially passive mode. When avoiding, an individual does not immediately pursue his or her own concerns or those of the other person. He or she does not address the conflict. Avoiding might take the form of diplomatically sidestepping an issue, postponing an issue until a better time, or simply withdrawing from a threatening situation.
es: es no asertivo y no cooperativo, un modo esencialmente pasivo. Cuando se evita, una persona no persigue de inmediato sus propias preocupaciones ni las de la otra persona. No aborda el conflicto. Evitar puede tomar la forma de eludir diplomáticamente un problema, posponer un problema hasta un mejor momento o simplemente retirarse de una situación amenazante.
pl: jest nieasertywny i niewspółpracujący - to zasadniczo tryb bierny. W trybie unikania jednostka nie natychmiast dąży do zaspokojenia swoich własnych obaw ani obaw drugiej osoby. Nie zajmuje się konfliktem. Unikanie może przybrać formę dyplomatycznego omijania problemu, odkładania problemu na później lub po prostu wycofania się z sytuacji zagrażającej.

# accommodatingDefinition
source: is unassertive and cooperative—the opposite of competing. When accommodating, an individual neglects his or her own concerns to satisfy the concerns of the other person; there is an element of self-sacrifice in this mode. Accommodating might take the form of selfless generosity or charity, obeying another person’s order when you would prefer not to, or yielding to another’s point of view.
es: es no asertivo y cooperativo, lo opuesto a competir. Cuando se acomoda, una persona descuida sus propias preocupaciones para satisfacer las preocupaciones de la otra persona; hay un elemento de sacrificio personal en este modo. Acomodar puede tomar la forma de generosidad o caridad desinteresada, obedecer la orden de otra persona cuando preferirías no hacerlo o ceder al punto de vista de otra persona.
pl: jest nieasertywny i współpracujący - przeciwieństwo rywalizacji. W trybie dostosowania jednostka zaniedbuje swoje własne obawy, aby zaspokoić obawy drugiej osoby; w tym trybie jest element poświęcenia własnej osoby. Dostosowanie może przybrać formę bezinteresownej hojności lub dobroczynności, posłuszeństwa wobec czyjegoś polecenia, gdy samemu byś tego nie chciał, lub ustępowania przed cudzym punktem widzenia.
